// 12
package main

// Рефлексия
// 10.4 Сделано как в эталоне. Про рекурсивное обощение для любого количества множеств - вроде не было в задании
// но по аналогии с пересечением любого количества множеств, переданных в списке, можно пройти циклом
// и премножить результирующее множество на следующее в списке. Не совсем рекурсия, но цикл выглядел бы
// более предпочтительным.
//
// 10.6 Подход в общем однозначный - словарь. Как в эталоне.
//
// 11.2 Решение как в эталоне - через ИЛИ. Да, количество ложноположительных срабатываний возрастет
//
// 11.3 Подсчет количества занятых бит - интересная идея. моя идея была по смыслу схожая - следить за тем, что не удалить
// бит, который мог быть использован, но со временем такой фильтр бы забился, конечно. Подсчет бит - более эффективная идея.
//
// 11.4 Интересное замечание про изучение и сужение круга возможных знчений. Я только до брут-форса додмался, который тут
// совсем плохое решение.

// Отзыв. Не смотря на то, что курс я проходил второй раз, я для себя переоткрыл работу с битами. В продакшене с битовыми
// операциями работать не приходится, поэтому эти новые тему немного заставляют мозг работать не на автомате. Также усложненные
// задания, особенно связанные опять же с редкими для меня структурами тоже заставили напрячься, что хорошо. Спасибо за вашу рабоу.
